---
kind: type
id: T:Autodesk.Revit.DB.BuiltInParameterGroup
source: html/9942b791-2892-0658-303e-abf99675c5a6.htm
---
# Autodesk.Revit.DB.BuiltInParameterGroup

An enumerated type listing all of the built-in parameter groups supported by Autodesk
Revit.

## Syntax (C#)
```csharp
[ObsoleteAttribute("This enumeration is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use members of the `GroupTypeId` class instead.")]
public enum BuiltInParameterGroup
```

## Remarks
Parameter groups are used to sort parameters within the Element Properties dialog.